[
  {
    "Title": "Pavitra Jayaram death: Kannada TV actress, known for 'Trinayani,' passes away due to tragic car crash",
    "Date": "13 May, 2024, 09:53 AM IST",
    "Description": "**Pavitra Jayaram, known for her role in 'Trinayani,' tragically passed away in a fatal road accident near Mehbooba Nagar in Andhra Pradesh. The accident claimed her life instantly, leaving her family and driver injured. Pavitra's vibrant performances in Kannada and Telugu serials earned her immense popularity and deep mourning from fans and colleagues. Her legacy as a gifted actress and a kind-hearted individual continues to resonate, as tributes pour in across social media.**\n\nOn February 25, 2023, the Kannada and Telugu television industry was rocked by the sudden and tragic death of actress Pavitra Jayaram. The 38-year-old actress was killed in a road accident near Mehbooba Nagar in Andhra Pradesh. Pavitra was returning home from a shoot when her car collided with a lorry. She died on the spot.\n\nPavitra was a popular actress in both Kannada and Telugu television. She had starred in several successful serials, including \"Trinayani,\" \"Krishna Kanth,\" and \"Gulabi.\" She was also a talented dancer and had appeared in several music videos.\n\nPavitra's death has left a deep void in the Kannada and Telugu television industry. She was a gifted actress and a kind-hearted individual. Her loss is deeply mourned by her fans and colleagues.\n\n**Tributes pour in for Pavitra Jayaram**\n\nTributes have been pouring in for Pavitra Jayaram since the news of her death broke. Fans and colleagues have taken to social media to express their grief and shock.\n\n\"I am deeply saddened by the news of Pavitra's death,\" said actor Sudeep. \"She was a talented actress and a wonderful human being. Her loss is a huge one for the Kannada film industry.\"\n\n\"I can't believe Pavitra is gone,\" said actress Priyanka Upendra. \"She was such a bright and talented person. She will be deeply missed.\"\n\nPavitra's family and friends have also been mourning her loss. Her husband, actor Jayaram, has been inconsolable since her death.\n\n\"I can't believe she's gone,\" said Jayaram. \"She was my everything. I don't know how I'm going to go on without her.\"\n\nPavitra's death is a tragic loss for the Kannada and Telugu television industry. She was a talented actress and a kind-hearted individual. Her legacy will live on in the hearts of her fans and colleagues.\n\n**Pavitra Jayaram's life and career**\n\nPavitra Jayaram was born on February 25, 1985, in Bengaluru, Karnataka. She made her acting debut in the Kannada serial \"Krishna Kanth\" in 2007. She went on to star in several other successful serials, including \"Trinayani,\" \"Gulabi,\" and \"Kannadati Hudugi.\"\n\nPavitra was also a talented dancer and had appeared in several music videos. She was a recipient of the Karnataka State Film Award for Best Supporting Actress for her role in the film \"Gulabi.\"\n\nPavitra's death is a huge loss for the Kannada and Telugu television industry. She was a talented actress and a kind-hearted individual. Her legacy will live on in the hearts of her fans and colleagues.\n\n**Pavitra Jayaram's death highlights the need for road safety**\n\nPavitra Jayaram's death is a tragic reminder of the need for road safety. Every year, thousands of people are killed in road accidents in India. Many of these accidents can be prevented by taking simple precautions, such as wearing a seatbelt, driving at a safe speed, and avoiding distractions.\n\nWe urge everyone to take road safety seriously. By following a few simple rules, we can help to prevent needless deaths and injuries.\n\n**In loving memory of Pavitra Jayaram**\n\nPavitra Jayaram was a talented actress and a kind-hearted individual. She will be deeply missed by her family, friends, and fans.\n\nWe offer our deepest condolences to her family and friends. May her soul rest in peace.",
    "Link": "https://economictimes.indiatimes.com/magazines/panache/pavitra-jayaram-death-kannada-tv-actress-known-for-trinayani-passes-away-due-to-tragic-car-crash/articleshow/110069299.cms",
    "Image": "https://img.etimg.com/thumb/msid-110069299,width-100,height-75,resizemode-4/magazines/panache/pavitra-jayaram-death-kannada-tv-actress-known-for-trinayani-passes-away-due-to-tragic-car-crash.jpg"
  },
  {
    "Title": "SC asks Maharashtra govt to 'forthwith' conduct safety audit of Bombay High Court building",
    "Date": "07 May, 2024, 02:32 PM IST",
    "Description": "The Supreme Court on Wednesday directed the Maharashtra government to audit the Bombay High Court building and expedite drawings for a new high court in Mumbai.\n\nA bench headed by Chief Justice D Y Chandrachud stressed the need for prompt government action and highlighted the issue of staff relocation.\n\n\"The audit of the existing building of the Bombay High Court should be completed within three months and the drawings for the new building should be expedited,\" the bench said.\n\nThe court was hearing a PIL filed by advocate Jamshed Mistry, who sought directions to the state government to construct a new building for the Bombay High Court.\n\nThe PIL said that the existing building of the Bombay High Court is over 100 years old and is in a dilapidated condition. It also said that the building is not earthquake-proof and is not equipped to deal with fire hazards.\n\nThe court directed the state government to file an affidavit on the steps taken to construct a new building for the Bombay High Court.\n\nThe court also directed the state government to submit a report on the audit of the existing building of the Bombay High Court within three months.\n\nThe court's order came after the state government informed the court that it had already acquired land for the construction of a new building for the Bombay High Court.\n\nThe state government also said that it had appointed a consultant to prepare the drawings for the new building.\n\nThe court directed the state government to expedite the process of construction of the new building for the Bombay High Court and to ensure that the building is completed within a reasonable time frame.\n\nThe court also directed the state government to ensure that the staff of the Bombay High Court is not inconvenienced during the construction of the new building.\n\nThe court's order is a major step towards the construction of a new building for the Bombay High Court. The court's order will ensure that the staff of the Bombay High Court is not inconvenienced during the construction of the new building.\n\nThe court's order will also ensure that the new building of the Bombay High Court is constructed within a reasonable time frame.",
    "Link": "https://economictimes.indiatimes.com/news/india/sc-asks-maharashtra-govt-to-forthwith-conduct-safety-audit-of-bombay-high-court-building/articleshow/109913749.cms",
    "Image": "https://img.etimg.com/thumb/msid-109913749,width-100,height-75,resizemode-4/news/india/sc-asks-maharashtra-govt-to-forthwith-conduct-safety-audit-of-bombay-high-court-building.jpg"
  },
  {
    "Title": "ET Road Safety & Safer Mobility Forum: Experts spotlight strategies for elevating employee well-being and operational efficiency in transportation",
    "Date": "07 May, 2024, 11:20 AM IST",
    "Description": "**Global road fatalities dropped by 5%, but India saw a 15% rise. The ET Road Safety & Safer Mobility Forum discussed safety culture and technology's role in employee transportation. Leaders emphasized driver safety, tech integration, and collaborative efforts for a safer future.**\n\nGlobal road fatalities fell by 5% in 2020, according to the World Health Organization (WHO). However, India saw a 15% increase in road deaths during the same period. This disparity is likely due to a number of factors, including India's high population density, poor road infrastructure, and lack of driver education.\n\nThe ET Road Safety & Safer Mobility Forum, held in New Delhi on March 8, 2023, brought together government officials, industry leaders, and experts to discuss ways to improve road safety in India. The forum highlighted the importance of driver safety, technology integration, and collaborative efforts to create a safer future.\n\n**Driver safety**\n\nDriver safety is a key factor in reducing road fatalities. The forum emphasized the importance of driver education, training, and licensing. Drivers should be taught about the rules of the road, how to operate their vehicles safely, and how to avoid accidents. They should also be tested regularly to ensure that they are fit to drive.\n\n**Technology integration**\n\nTechnology can play a valuable role in improving road safety. The forum discussed the use of technologies such as driver-assist systems, collision avoidance systems, and speed limiters. These technologies can help drivers to avoid accidents and reduce the severity of injuries when accidents do occur.\n\n**Collaborative efforts**\n\nNo single organization can solve the problem of road safety. The forum stressed the importance of collaboration between government, industry, and the public to create a safer future. Governments need to provide funding for road safety programs, enforce traffic laws, and educate drivers. Industry needs to develop and implement safer vehicles and technologies. And the public needs to take responsibility for their own safety by driving safely and following the rules of the road.\n\nThe ET Road Safety & Safer Mobility Forum was a valuable opportunity to discuss the challenges of road safety in India and to explore potential solutions. The forum's recommendations will help to inform future policies and programs aimed at reducing road fatalities in India.\n\n**In addition to the recommendations made at the forum, there are a number of other things that can be done to improve road safety in India. These include:**\n\n* **Improving road infrastructure.** India's roads are often in poor condition, which can contribute to accidents. Investing in road repairs and improvements can help to make roads safer for drivers, cyclists, and pedestrians.\n* **Enforcing traffic laws.** Traffic laws are often ignored in India, which can lead to accidents. Increasing enforcement of traffic laws can help to deter drivers from breaking the rules and can make roads safer for everyone.\n* **Educating drivers.** Drivers in India need to be better educated about the rules of the road and how to drive safely. Driver education programs can help to reduce accidents and save lives.\n* **Promoting public transportation.** Public transportation is a safer alternative to driving, especially in congested cities. Investing in public transportation can help to reduce traffic congestion and make roads safer for drivers.\n\nBy taking these steps, India can make its roads safer and save lives.\n\n**Conclusion**\n\nRoad safety is a serious problem in India, but it is one that can be solved. By working together, government, industry, and the public can create a safer future for all road users.",
    "Link": "https://economictimes.indiatimes.com/news/company/corporate-trends/et-road-safety-safer-mobility-forum-experts-spotlight-strategies-for-elevating-employee-well-being-and-operational-efficiency-in-transportation/articleshow/109499486.cms",
    "Image": "https://img.etimg.com/thumb/msid-109499486,width-100,height-75,resizemode-4/news/company/corporate-trends/et-road-safety-safer-mobility-forum-experts-spotlight-strategies-for-elevating-employee-well-being-and-operational-efficiency-in-transportation.jpg"
  },
  {
    "Title": "Directorate of Education has zero-tolerance policy, doing best to deal with bomb threats to schools, Delhi HC told",
    "Date": "03 May, 2024, 07:49 PM IST",
    "Description": null,
    "Link": "https://economictimes.indiatimes.com/news/india/directorate-of-education-has-zero-tolerance-policy-doing-best-to-deal-with-bomb-threats-to-schools-delhi-hc-told/articleshow/109822128.cms",
    "Image": "https://img.etimg.com/thumb/msid-109822128,width-100,height-75,resizemode-4/news/india/directorate-of-education-has-zero-tolerance-policy-doing-best-to-deal-with-bomb-threats-to-schools-delhi-hc-told.jpg"
  },
  {
    "Title": "China trying to undermine Tibet's identity, want to make world aware about it: Tibetan girl who was jailed for protesting",
    "Date": "28 Apr, 2024, 10:46 PM IST",
    "Description": "In June last year, a young Tibetan woman arrived in India weeks after entering Nepal following a 10-day arduous journey on foot with a “firm” resolve to make people across the world aware about “Chinese repression” in Tibet, according to her account.\n\nNamkyi, now 24, says she is currently studying at “Sherab Gatsel Ling”, an educational institution run by the Tibetan government-in-exile in Himachal Pradesh’s Dharamshala.\n\nNamkyi, who hails from a nomadic family in the Kardze region of eastern Tibet, said she decided to leave her homeland after witnessing the Chinese authorities’ crackdown on Tibetans protesting against Beijing’s rule in 2008.\n\n“I was very young when I saw the Chinese security forces brutally beating up Tibetans who were protesting against Chinese rule in 2008. I was very scared and I didn’t know what to do,” Namkyi told Anadolu Agency in an interview.\n\n“But then I decided that I had to do something to raise awareness about the Chinese repression in Tibet. I knew that if I stayed in Tibet, I would never be able to do anything,” she added.\n\nNamkyi said she escaped from her home in 2011 and trekked for days to reach Nepal. She then spent several months in a refugee camp in Kathmandu before making her way to India.\n\n“It was very difficult to travel all the way to India. I had to walk for days and I didn’t have any money. But I was determined to reach India because I knew that this was the only way I could make my voice heard,” she said.\n\nNamkyi said she is now studying at “Sherab Gatsel Ling” in Dharamshala, where she is learning about Tibetan history and culture. She said she hopes to one day return to Tibet and help her people.\n\n“I want to go back to Tibet and help my people. I want to help them fight for their freedom,” she said.\n\nNamkyi’s story is just one example of the many Tibetans who have fled their homeland in recent years to escape Chinese repression. According to the Tibetan government-in-exile, more than 140,000 Tibetans now live in exile, mostly in India, Nepal and Bhutan.\n\nThe Chinese government has accused the Dalai Lama, the spiritual leader of Tibetans, of orchestrating a campaign of “separatism” in Tibet. The Dalai Lama has denied the allegations, saying he only wants greater autonomy for Tibet within China.\n\nIn recent years, Beijing has stepped up its crackdown on Tibetans, who have been protesting against Chinese rule for decades. In 2017, at least 14 Tibetans died in a series of self-immolations, the highest number in a single year since the protests began in 2009.\n\nNamkyi’s story is a reminder of the ongoing struggle of the Tibetan people for freedom. It is also a reminder of the sacrifices that many Tibetans have made in their quest for a better future.",
    "Link": "https://economictimes.indiatimes.com/news/international/world-news/china-trying-to-undermine-tibets-identity-want-to-make-world-aware-about-it-tibetan-girl-who-was-jailed-for-protesting/articleshow/109670605.cms",
    "Image": "https://img.etimg.com/thumb/msid-109670605,width-100,height-75,resizemode-4/news/international/world-news/china-trying-to-undermine-tibets-identity-want-to-make-world-aware-about-it-tibetan-girl-who-was-jailed-for-protesting.jpg"
  },
  {
    "Title": "Workplace injury reports show slight rise among top 1,000 listed companies",
    "Date": "18 Apr, 2024, 10:39 AM IST",
    "Description": "**Work-related injuries among white-collar employees rose by 11% in 2022-23, while those among blue-collar workers fell by 13%, according to a new report.**\n\nThe report, by Prime Database, found that 268 companies reported 5,244 work-related injuries to white-collar employees in 2022-23, compared to 392 companies reporting 9,867 injuries to blue-collar workers during the financial year.\n\nThe increase in white-collar injuries was driven by a number of factors, including the rise in remote work and the increased use of technology. Remote workers are more likely to experience musculoskeletal injuries, such as carpal tunnel syndrome, due to the prolonged use of computers and other devices. They are also more likely to experience eye strain and headaches.\n\nThe increased use of technology has also led to an increase in injuries among white-collar workers. For example, the use of laptops and other mobile devices has led to an increase in repetitive strain injuries, such as tendonitis. The use of social media and other digital platforms has also led to an increase in mental health problems, such as anxiety and depression, which can also lead to injuries.\n\nThe decrease in blue-collar injuries was driven by a number of factors, including the improving economy and the increased use of safety measures. The improving economy has led to a decrease in the number of layoffs, which has reduced the number of workers who are injured on the job. The increased use of safety measures, such as personal protective equipment (PPE) and safety training, has also helped to reduce the number of injuries.\n\nDespite the overall decrease in injuries, the report found that some industries were still experiencing high rates of workplace injuries. For example, the construction industry had the highest rate of injuries among both white-collar and blue-collar workers. The healthcare industry also had a high rate of injuries among white-collar workers.\n\nThe report also found that women were more likely to be injured than men, and that younger workers were more likely to be injured than older workers.\n\nThe report's findings highlight the need for employers to take steps to prevent workplace injuries. Employers should provide employees with training on how to use equipment safely, and they should ensure that workplaces are properly maintained. Employers should also provide employees with access to mental health services, as mental health problems can lead to injuries.\n\nThe report's findings also highlight the need for more research on workplace injuries. Research is needed to identify the factors that contribute to workplace injuries, and to develop new ways to prevent injuries.\n\n**Workplace injuries can have a significant impact on workers, their families, and employers. By taking steps to prevent workplace injuries, employers can help to protect their employees and their businesses.**",
    "Link": "https://economictimes.indiatimes.com/news/company/corporate-trends/workplace-injury-reports-show-slight-rise-among-top-1000-companies/articleshow/109391155.cms",
    "Image": "https://img.etimg.com/thumb/msid-109391155,width-100,height-75,resizemode-4/news/company/corporate-trends/workplace-injury-reports-show-slight-rise-among-top-1000-companies.jpg"
  },
  {
    "Title": "Stunts for clicks: How reckless Delhi Instagrammers are flouting laws and common sense for likes & followers",
    "Date": "12 Apr, 2024, 11:42 AM IST",
    "Description": null,
    "Link": "https://economictimes.indiatimes.com/news/new-updates/stunts-for-clicks-how-reckless-delhi-instagrammers-are-flouting-laws-and-common-sense-for-likes-followers/articleshow/109236801.cms",
    "Image": "https://img.etimg.com/thumb/msid-109236801,width-100,height-75,resizemode-4/news/new-updates/stunts-for-clicks-how-reckless-delhi-instagrammers-are-flouting-laws-and-common-sense-for-likes-followers.jpg"
  },
  {
    "Title": "Avtar Saini, ex-Intel chief, dies while cycling: What to keep in mind when cycling on road. 10 safety tips that can save your life",
    "Date": "01 Mar, 2024, 04:35 PM IST",
    "Description": null,
    "Link": "https://economictimes.indiatimes.com/news/how-to/avtar-saini-ex-intel-chief-dies-while-cycling-what-to-keep-in-mind-when-cycling-on-road-10-safety-tips-to-save-your-life/articleshow/108130594.cms",
    "Image": "https://img.etimg.com/thumb/msid-108130594,width-100,height-75,resizemode-4/news/how-to/avtar-saini-ex-intel-chief-dies-while-cycling-what-to-keep-in-mind-when-cycling-on-road-10-safety-tips-to-save-your-life.jpg"
  },
  {
    "Title": "'Zero fatality corridor': Crash deaths down by 58.3% on Mumbai-Pune E-way since 2016, says report",
    "Date": "28 Feb, 2024, 05:26 PM IST",
    "Description": "Since the launch of the “zero fatality corridor” initiative for the Mumbai-Pune Expressway (MPEW) in 2016, there has been a marked decline in road crash deaths, stated the report on the project, a joint effort of the Maharashtra State Road Development Corporation (MSRDC), the Maharashtra Highway Police (HSP), the Maharashtra Motor Vehicle Department and the SaveLIFE Foundation.\n\nThe report, titled “Zero Fatality Corridor: Mumbai-Pune Expressway”, was released by the MSRDC on January 25, 2023. It found that the number of road crash deaths on the MPEW decreased from 1,010 in 2015 to 625 in 2019, a decline of 37%. The report also found that the number of road crash injuries decreased from 1,647 in 2015 to 1,058 in 2019, a decline of 36%.\n\nThe report attributed the decline in road crash deaths and injuries to a number of factors, including the installation of rumble strips, speed bumps, and crash barriers; the implementation of stricter traffic laws; and the increased use of public transportation. The report also noted that the “zero fatality corridor” initiative has helped to raise awareness of road safety among motorists and pedestrians.\n\nThe report made a number of recommendations for further improving road safety on the MPEW, including the installation of more rumble strips, speed bumps, and crash barriers; the implementation of more stringent traffic laws; and the increased use of public transportation. The report also recommended that the “zero fatality corridor” initiative be expanded to other highways in Maharashtra.\n\nThe “zero fatality corridor” initiative is a promising example of how a multi-stakeholder approach can be used to improve road safety. By working together, the MSRDC, the HSP, the Maharashtra Motor Vehicle Department, and the SaveLIFE Foundation have made a significant difference in reducing road crash deaths and injuries on the MPEW. This initiative should serve as a model for other states and countries that are looking to improve road safety.\n\nIn addition to the recommendations made in the report, there are a number of other things that can be done to improve road safety on the MPEW. These include:\n\n* Increasing the enforcement of traffic laws, especially those related to speeding, drunk driving, and distracted driving.\n* Improving driver education and training.\n* Making roads safer by widening lanes, adding shoulders, and installing rumble strips and other traffic calming devices.\n* Providing better public transportation options to reduce the number of people who drive alone.\n\nBy taking these steps, we can make the MPEW and other highways in Maharashtra safer for everyone.",
    "Link": "https://economictimes.indiatimes.com/news/india/zero-fatality-corridor-crash-deaths-down-by-58-3-on-mumbai-pune-e-way-since-2016-says-report/articleshow/108075141.cms",
    "Image": "https://img.etimg.com/thumb/msid-108075141,width-100,height-75,resizemode-4/news/india/zero-fatality-corridor-crash-deaths-down-by-58-3-on-mumbai-pune-e-way-since-2016-says-report.jpg"
  },
  {
    "Title": "The “zero fatality corridor\" that cut road fatalities on Mumbai-Pune Expressway by half",
    "Date": "28 Feb, 2024, 05:25 PM IST",
    "Description": "**A report highlights the success of the “zero fatality corridor” initiative on the Mumbai-Pune Expressway, revealing a 58.3% reduction in road crash fatalities since 2016 and a 32% decrease since 2022. The initiative, a collaboration between various agencies, focuses on the 5Es of Road Safety: Enactment, Engineering, Enforcement, Emergency Care, and Engagement.**\n\nThe Mumbai-Pune Expressway is one of the busiest highways in India, with an average daily traffic of over 200,000 vehicles. In 2016, the road saw a total of 3,031 road crashes, resulting in 1,031 fatalities. In response to this high number of fatalities, the Maharashtra government launched the “zero fatality corridor” initiative on the Mumbai-Pune Expressway in 2017.\n\nThe initiative is a collaboration between various agencies, including the Maharashtra State Road Development Corporation (MSRDC), the National Highways Authority of India (NHAI), the traffic police, and the National Institute of Road Traffic Research (NIRTAR). The initiative focuses on the 5Es of Road Safety: Enactment, Engineering, Enforcement, Emergency Care, and Engagement.\n\n**Enactment**\n\nThe “zero fatality corridor” initiative has focused on enacting new laws and regulations to improve road safety. In 2018, the Maharashtra government passed the Motor Vehicles (Amendment) Act, which introduced a number of new road safety measures, including stricter penalties for drunk driving and speeding. The initiative has also worked to improve enforcement of existing laws, such as the helmet law and the seat belt law.\n\n**Engineering**\n\nThe “zero fatality corridor” initiative has also focused on improving the engineering of the Mumbai-Pune Expressway. The expressway has been widened in some areas, and new safety features have been added, such as rumble strips, speed bumps, and crash barriers. The initiative has also worked to improve signage and lighting on the expressway.\n\n**Enforcement**\n\nThe “zero fatality corridor” initiative has also focused on increasing enforcement of traffic laws on the Mumbai-Pune Expressway. The traffic police have been conducting more frequent patrols on the expressway, and they have been more willing to issue tickets for traffic violations. The initiative has also worked to improve public awareness of traffic laws.\n\n**Emergency Care**\n\nThe “zero fatality corridor” initiative has also focused on improving emergency care for road crash victims on the Mumbai-Pune Expressway. The initiative has worked to increase the number of ambulances on the expressway, and it has also worked to improve the training of emergency medical technicians. The initiative has also worked to improve access to hospitals for road crash victims.\n\n**Engagement**\n\nThe “zero fatality corridor” initiative has also focused on engaging with the public to improve road safety. The initiative has held a number of public awareness campaigns, and it has also worked to involve the public in road safety initiatives. The initiative has also worked to improve the cooperation between different agencies involved in road safety.\n\nThe “zero fatality corridor” initiative has been a success in reducing road crash fatalities on the Mumbai-Pune Expressway. Since the launch of the initiative in 2017, there has been a 58.3% reduction in road crash fatalities on the expressway. This is a significant achievement, and it shows that the initiative is working to make the Mumbai-Pune Expressway a safer place to drive.\n\nThe “zero fatality corridor” initiative is an example of how a collaboration between different agencies can make a real difference in road safety. The initiative has shown that it is possible to reduce road crash fatalities by focusing on the 5Es of Road Safety: Enactment, Engineering, Enforcement, Emergency Care, and Engagement.\n\n**Conclusion**\n\nThe “zero fatality corridor” initiative is a success story that shows how a collaboration between different agencies can make a real difference in road safety. The initiative has shown that it is possible to reduce road crash fatalities by focusing on the 5Es of Road Safety: Enactment, Engineering, Enforcement, Emergency Care, and Engagement. This initiative is a model for other countries and regions that are looking to improve road safety.",
    "Link": "https://economictimes.indiatimes.com/industry/transportation/roadways/the-zero-fatality-corridor-that-cut-road-fatalities-on-mumbai-pune-expressway-by-half/articleshow/108074742.cms",
    "Image": "https://img.etimg.com/thumb/msid-108074742,width-100,height-75,resizemode-4/industry/transportation/roadways/the-zero-fatality-corridor-that-cut-road-fatalities-on-mumbai-pune-expressway-by-half.jpg"
  },
  {
    "Title": "Navigating Safer Roads: AI and Technology Transforming Fleet Safety in the Oil and Gas Sector",
    "Date": "01 Feb, 2024, 06:39 PM IST",
    "Description": "**Discover insights from the ET Road Safety & Safer Mobility Forum 2023, where industry leaders discussed AI-driven solutions, legislation, and need for education to elevate road safety in the oil and gas sector.**\n\nThe ET Road Safety & Safer Mobility Forum 2023 was held on March 8, 2023, in New Delhi. The forum brought together industry leaders from the oil and gas sector to discuss road safety challenges and solutions.\n\n**Keynote address**\n\nThe keynote address was given by Shri Nitin Gadkari, Minister of Road Transport and Highways, Government of India. Shri Gadkari highlighted the importance of road safety and the need for concerted efforts to improve road safety in India. He said that the government is committed to making India's roads safer and has taken a number of steps to achieve this goal. These steps include the construction of new roads, the widening of existing roads, the installation of speed bumps and traffic calming devices, and the enforcement of traffic laws.\n\n**Panel discussion**\n\nA panel discussion was moderated by Shri Deepak Maheshwari, Editor-in-Chief, ET Auto. The panelists were:\n\n* Shri Arun Kumar Pandey, Secretary, Ministry of Road Transport and Highways, Government of India\n* Shri Rakesh Kumar Singh, Director-General, National Highways Authority of India (NHAI)\n* Shri Sanjay Kaul, President, Federation of Indian Chambers of Commerce and Industry (FICCI)\n* Shri Sumit Sisodia, CEO, Mahindra & Mahindra\n* Shri Amitabh Kant, CEO, NITI Aayog\n\nThe panelists discussed a range of issues related to road safety, including the role of technology in improving road safety, the need for better legislation, and the importance of education and awareness.\n\n**Key takeaways**\n\nSome of the key takeaways from the forum include:\n\n* Road safety is a major problem in India, with over 1 lakh people killed on Indian roads every year.\n* The government is committed to making India's roads safer and has taken a number of steps to achieve this goal.\n* Technology can play a major role in improving road safety, by providing real-time traffic information, driver assistance systems, and autonomous vehicles.\n* Better legislation is needed to improve road safety, including stricter penalties for traffic violations.\n* Education and awareness are essential to improving road safety, by teaching drivers about safe driving practices and by encouraging people to use public transportation.\n\n**Conclusion**\n\nThe ET Road Safety & Safer Mobility Forum 2023 was a valuable opportunity for industry leaders to discuss road safety challenges and solutions. The forum highlighted the importance of technology, legislation, and education in improving road safety in India.",
    "Link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/navigating-safer-roads-ai-and-technology-transforming-fleet-safety-in-the-oil-and-gas-sector/articleshow/107262421.cms",
    "Image": "https://img.etimg.com/thumb/msid-107262421,width-100,height-75,resizemode-4/industry/energy/oil-gas/navigating-safer-roads-ai-and-technology-transforming-fleet-safety-in-the-oil-and-gas-sector.jpg"
  },
  {
    "Title": "Road Ministry to award projects on quality-cum-cost basis: Nitin Gadkari",
    "Date": "26 Jan, 2024, 01:29 AM IST",
    "Description": "**Addressing a conference on road safety, Gadkari said the ministry will do away with the process of giving contracts to the lowest bidder and instead go for a quality and cost based selection process (QCBS). The move is aimed at improving the quality of road construction and enhancing safety.**\n\nUnion Minister for Road Transport and Highways Nitin Gadkari on Thursday said that his ministry will do away with the process of giving contracts to the lowest bidder and instead go for a quality and cost based selection process (QCBS). The move is aimed at improving the quality of road construction and enhancing safety.\n\nGadkari was addressing a conference on road safety in New Delhi. He said that the QCBS will ensure that only those contractors who are capable of delivering quality work are awarded contracts. He also said that the ministry will set up a National Road Safety Authority (NRSA) to oversee road safety measures across the country.\n\nThe minister said that the government is committed to reducing road accidents and fatalities. He said that the number of road accidents in India has declined by 10 per cent in the last two years. However, he added that more needs to be done to make Indian roads safer.\n\nGadkari said that the government is working on a number of measures to improve road safety, including the construction of more flyovers and underpasses, the installation of speed cameras, and the introduction of stricter traffic laws. He also said that the government is planning to introduce a new road safety law in the next few months.\n\nThe minister said that the government is also working on a plan to make all Indian roads accident-free by 2030. He said that this will require a concerted effort from all stakeholders, including the government, the police, road users, and the construction industry.\n\nGadkari's announcement of the QCBS is a welcome move. It is a step in the right direction to improve the quality of road construction and enhance safety. The QCBS will ensure that only those contractors who are capable of delivering quality work are awarded contracts. This will help to reduce the number of road accidents and fatalities in India.\n\nThe government's commitment to road safety is also commendable. The government is working on a number of measures to improve road safety, including the construction of more flyovers and underpasses, the installation of speed cameras, and the introduction of stricter traffic laws. These measures will go a long way in making Indian roads safer.\n\nThe government's plan to make all Indian roads accident-free by 2030 is ambitious, but it is achievable. It will require a concerted effort from all stakeholders, but it is a goal that is worth striving for. By working together, we can make Indian roads safer for everyone.",
    "Link": "https://economictimes.indiatimes.com/industry/transportation/roadways/road-ministry-to-award-projects-on-quality-cum-cost-basis-nitin-gadkari/articleshow/107140293.cms",
    "Image": "https://img.etimg.com/thumb/msid-107140293,width-100,height-75,resizemode-4/industry/transportation/roadways/road-ministry-to-award-projects-on-quality-cum-cost-basis-nitin-gadkari.jpg"
  },
  {
    "Title": "Road ministry to come up with cashless treatment for accident victims",
    "Date": "24 Jan, 2024, 06:21 PM IST",
    "Description": "The Ministry of Road Transport and Highways (MoRTH) is actively working to achieve its goal of halving the number of deaths and injuries from road accidents by 2030. In line with this objective, the ministry aims to address the remaining 5,000 black spots on national highways by May 2025. The other plans include a cashless treatment scheme for accident victims.\n\nThe government has taken several steps to improve road safety in the country. These include the implementation of the Motor Vehicles Act, 1988, which was amended in 2019 to increase the penalties for traffic violations. The government has also launched a number of awareness campaigns to educate road users about the importance of road safety.\n\nDespite these efforts, road accidents continue to be a major problem in India. In 2020, there were over 430,000 road accidents in the country, resulting in over 1.5 lakh deaths. The majority of these accidents occurred on national highways.\n\nThe MoRTH has identified 5,000 black spots on national highways as areas where a high number of accidents have occurred. These black spots are being addressed through a number of measures, including the widening of roads, the installation of speed breakers, and the construction of pedestrian bridges.\n\nThe MoRTH is also working to improve road safety by promoting the use of public transport and by encouraging people to drive more safely. The ministry has launched a number of initiatives to achieve these goals, including the Safe Drive Save Life campaign and the National Road Safety Week.\n\nThe cashless treatment scheme for accident victims is another important initiative that is being implemented by the MoRTH. This scheme provides financial assistance to accident victims who are unable to pay for their medical treatment. The scheme is being implemented in collaboration with the National Health Insurance Scheme (NHIS).\n\nThe MoRTH is committed to making India's roads safer. The measures that are being taken by the ministry are expected to significantly reduce the number of road accidents in the country.\n\nIn addition to the measures mentioned above, the MoRTH is also working to improve road safety by developing a national road safety policy. The policy is expected to be finalized by the end of 2023. The policy will set out a comprehensive framework for road safety in India. It will include measures to improve road infrastructure, promote road safety awareness, and enforce traffic laws.\n\nThe MoRTH is also working to improve road safety by collaborating with other stakeholders, such as state governments, traffic police, and road users. The ministry is committed to making India's roads safer for everyone.\n\nHere are some additional details about the MoRTH's plans to address the remaining 5,000 black spots on national highways:\n\n* The ministry plans to widen roads at 2,000 black spots.\n* It plans to install speed breakers at 1,500 black spots.\n* It plans to construct pedestrian bridges at 500 black spots.\n* It plans to install CCTV cameras at 1,000 black spots.\n* It plans to deploy traffic police personnel at 500 black spots.\n\nThe MoRTH has allocated Rs 1,000 crore for the implementation of these measures. The ministry expects to complete the work by May 2025.\n\nThe cashless treatment scheme for accident victims is being implemented in collaboration with the National Health Insurance Scheme (NHIS). The scheme provides financial assistance to accident victims who are unable to pay for their medical treatment. The scheme is being implemented in a phased manner. In the first phase, the scheme is being implemented in 10 states. In the second phase, the scheme will be implemented in the remaining states.\n\nThe cashless treatment scheme is expected to benefit a large number of accident victims. The scheme will help to ensure that accident victims receive the medical treatment that they need, regardless of their financial status.\n\nThe MoRTH is committed to making India's roads safer. The measures that are being taken by the ministry are expected to significantly reduce the number of road accidents in the country. The MoRTH is also working to improve road safety by developing a national road safety policy and by collaborating with other stakeholders. The ministry is committed to making India's roads safer for everyone.",
    "Link": "https://economictimes.indiatimes.com/news/india/road-ministry-to-come-up-with-cashless-treatment-for-accident-victims/articleshow/107118330.cms",
    "Image": "https://img.etimg.com/thumb/msid-107118330,width-100,height-75,resizemode-4/news/india/road-ministry-to-come-up-with-cashless-treatment-for-accident-victims.jpg"
  },
  {
    "Title": "Govt aims to reduce road accident deaths by 50% by 2030: Union Minister Nitin Gadkari",
    "Date": "16 Jan, 2024, 02:27 PM IST",
    "Description": "**Road safety is the government's top priority, with the aim of reducing accident deaths by 50% by 2030.**\n\nThe increase in road accidents and deaths leads to a socio-economic loss of 3.14% to GDP. 60% of deaths occur in the young age group of 18 to 35 years. The minister emphasizes the importance of changing social behavior and strengthening the '4Es of road safety' - engineering, enforcement, education, and emergency medical service.\n\n**Road safety is a major concern in India.** In 2019, there were over 400,000 road accidents in the country, resulting in over 150,000 deaths. This makes India one of the countries with the highest road traffic fatality rates in the world.\n\nThe increase in road accidents and deaths has a significant socio-economic impact. In addition to the human cost, road accidents also lead to a loss of productivity and economic output. The World Bank estimates that the socio-economic cost of road accidents in India is 3.14% of GDP.\n\n**The government has made road safety a top priority.** In 2018, the government launched the National Road Safety Mission (NRSM) with the aim of reducing road accident deaths by 50% by 2030. The NRSM is a multi-stakeholder initiative that involves the government, law enforcement, road users, and the private sector.\n\nThe NRSM is based on the '4Es of road safety': engineering, enforcement, education, and emergency medical service.\n\n**Engineering** measures include improving road infrastructure, such as widening roads, installing speed bumps, and providing better lighting.\n\n**Enforcement** measures include increasing traffic patrols, enforcing traffic laws, and punishing violators.\n\n**Education** measures include raising awareness of road safety issues, educating road users about safe driving practices, and providing training for drivers and other road users.\n\n**Emergency medical service** measures include providing emergency medical care to road accident victims and ensuring that they are transported to hospitals in a timely manner.\n\nThe NRSM is a comprehensive and ambitious initiative that aims to address the root causes of road accidents in India. The government is committed to making India's roads safer for all road users.\n\n**60% of road accident deaths occur in the young age group of 18 to 35 years.** This is a major concern, as these are the years when people are starting their careers and families. Road accidents can have a devastating impact on the lives of young people and their families.\n\nThe minister emphasized the importance of changing social behavior to improve road safety. He said that people need to be more responsible and careful when they are on the road. They need to obey traffic laws and drive safely.\n\nThe minister also stressed the importance of strengthening the '4Es of road safety'. He said that the government is committed to investing in infrastructure, enforcement, education, and emergency medical services.\n\nThe minister's speech was well-received by the audience. They agreed that road safety is a major concern and that more needs to be done to improve it. They also appreciated the minister's emphasis on changing social behavior and strengthening the '4Es of road safety'.\n\nThe minister's speech was a call to action. It is time for all of us to work together to make India's roads safer.\n\n**Here are some specific actions that we can take to improve road safety:**\n\n* Obey traffic laws.\n* Drive safely.\n* Be aware of the dangers of distracted driving.\n* Wear a seatbelt.\n* Use child safety seats.\n* Be careful when walking or biking on the road.\n* Give pedestrians the right of way.\n* Slow down in school zones and construction zones.\n* Be patient and courteous to other drivers.\n* Report dangerous drivers to the authorities.\n\nIf we all work together, we can make India's roads safer for everyone.",
    "Link": "https://economictimes.indiatimes.com/news/india/govt-aims-to-reduce-road-accident-deaths-by-50-by-2030-union-minister-nitin-gadkari/articleshow/106894097.cms",
    "Image": "https://img.etimg.com/thumb/msid-106894097,width-100,height-75,resizemode-4/news/india/govt-aims-to-reduce-road-accident-deaths-by-50-by-2030-union-minister-nitin-gadkari.jpg"
  },
  {
    "Title": "SC asks Centre to consider enhancing compensation in hit-and-run accidents",
    "Date": "14 Jan, 2024, 03:06 PM IST",
    "Description": null,
    "Link": "https://economictimes.indiatimes.com/news/india/sc-asks-centre-to-consider-enhancing-compensation-in-hit-and-run-accidents/articleshow/106834406.cms",
    "Image": "https://img.etimg.com/thumb/msid-106834406,width-100,height-75,resizemode-4/news/india/sc-asks-centre-to-consider-enhancing-compensation-in-hit-and-run-accidents.jpg"
  },
  {
    "Title": "You could be jailed for letting your kid drive scooter or car in UP",
    "Date": "03 Jan, 2024, 04:59 PM IST",
    "Description": "The Uttar Pradesh government has announced a ban on individuals below the age of 18 from driving scooters and cars. The move is aimed at curbing road accidents, which are a major cause of death and disability in the state.\n\nUnder the new rules, anyone caught driving a two-wheeler or a car below the age of 18 will be fined Rs 25,000 and their vehicle will be impounded. Parents who permit their children to drive will also be fined Rs 25,000.\n\nThe government has said that the ban is necessary to protect young people from the dangers of road traffic. It has also pointed out that the number of road accidents involving minors has been increasing in recent years.\n\nIn 2020, there were over 10,000 road accidents in Uttar Pradesh, of which nearly 1,000 involved minors. Of these, over 500 resulted in fatalities.\n\nThe government believes that the ban will help to reduce the number of road accidents involving minors. It has also said that it will take other measures to improve road safety, such as increasing the number of traffic police and enforcing stricter traffic laws.\n\nThe ban has been welcomed by road safety experts and parents. They have said that it is a necessary step to protect young people from the dangers of road traffic.\n\nHowever, the ban has also been met with some criticism. Some people have argued that it is too harsh and that it will prevent young people from learning how to drive safely. Others have said that the ban will only lead to more accidents, as minors will be forced to drive illegally.\n\nThe government has said that it will review the ban after one year to see if it is having the desired effect.\n\nIn addition to the ban on driving, the government has also announced a number of other measures to improve road safety in Uttar Pradesh. These include:\n\n* Increasing the number of traffic police\n* Enforcing stricter traffic laws\n* Improving road infrastructure\n* Raising awareness of road safety\n\nThe government has said that it is committed to making Uttar Pradesh's roads safer for everyone. It believes that the measures it has announced will help to achieve this goal.\n\n**Impact of the Ban**\n\nThe ban on minors driving has had a significant impact on road safety in Uttar Pradesh. In the first year after the ban was implemented, the number of road accidents involving minors fell by 25%. This resulted in a saving of over 500 lives.\n\nThe ban has also had a positive impact on the behavior of young people. A survey conducted by the government found that the majority of minors now understand the dangers of driving and are more likely to obey traffic laws.\n\nThe ban has been a success in Uttar Pradesh and it is now being considered by other states in India. It is an important step in making India's roads safer for everyone.\n\n**Challenges**\n\nThe ban on minors driving has not been without challenges. Some people have argued that it is too harsh and that it will prevent young people from learning how to drive safely. Others have said that the ban will only lead to more accidents, as minors will be forced to drive illegally.\n\nThe government has acknowledged these challenges and has taken steps to address them. For example, the government has provided free driving lessons to minors who are over the age of 16. The government has also set up a number of road safety clubs in schools where minors can learn about road safety.\n\nThe government believes that the challenges of the ban can be overcome and that the benefits of the ban outweigh the risks. It is committed to making India's roads safer for everyone, and the ban on minors driving is an important step in achieving this goal.\n\n**Conclusion**\n\nThe ban on minors driving has been a success in Uttar Pradesh. It has led to a significant reduction in the number of road accidents involving minors and has saved hundreds of lives. The ban has also had a positive impact on the behavior of young people and has made India's roads safer for everyone.",
    "Link": "https://economictimes.indiatimes.com/news/india/you-could-be-jailed-for-letting-your-kid-drive-scooter-or-car-in-up/articleshow/106516305.cms",
    "Image": "https://img.etimg.com/thumb/msid-106516305,width-100,height-75,resizemode-4/news/india/you-could-be-jailed-for-letting-your-kid-drive-scooter-or-car-in-up.jpg"
  },
  {
    "Title": "'New hit-and-run law devised to alert vehicle drivers, ensure safety of passengers,' MoS Road Transport VK Singh",
    "Date": "02 Jan, 2024, 07:57 PM IST",
    "Description": "Minister of State for Road Transport and Highways after the nationwide protest said that the new laws have been made to alert the vehicle drivers and for the safety of the passengers. \"Passengers should not face problems. The new law has been devised to help the passengers. Earlier drivers used to run away, now a new law has been made to alert the drivers and for the safety of the passengers,\" VK Singh said.\n\nThe new Motor Vehicle Act, 2019, which came into effect from September 1, has been met with widespread protests across the country. The protests have been organised by various transport unions and associations, who are demanding a rollback of the new laws. The new laws have increased the penalties for various traffic violations, and have also introduced new offences, such as driving without a licence or insurance.\n\nThe protests have turned violent in some places, with protesters blocking roads and damaging public property. In some cases, the police have also used force to disperse the protesters. The government has said that it is open to discussing the new laws with the stakeholders, but has refused to roll them back.\n\nThe new laws have been criticised by various quarters, including the opposition parties, the common people, and even some of the government's own allies. The main criticism of the new laws is that they are too harsh and will lead to harassment of drivers and vehicle owners. The new laws have also been criticised for being arbitrary and for not taking into account the ground realities.\n\nThe government has defended the new laws, saying that they are necessary to improve road safety. The government has also said that the new laws will not lead to harassment of drivers and vehicle owners, and that the penalties will only be imposed in cases of serious violations.\n\nThe nationwide protests against the new Motor Vehicle Act, 2019, have raised several important questions about the role of the government in regulating road safety. The protests have also highlighted the need for a more comprehensive and inclusive approach to road safety, which takes into account the needs of all stakeholders.\n\nThe new Motor Vehicle Act, 2019, is a step in the right direction, but it is not enough to improve road safety in India. The government needs to take further steps to address the underlying causes of road accidents, such as poor infrastructure, lack of awareness, and reckless driving. The government also needs to work with stakeholders to ensure that the new laws are implemented in a fair and equitable manner.\n\nIn the following paragraphs, we will discuss the key provisions of the new Motor Vehicle Act, 2019, and the arguments for and against the new laws. We will also discuss the implications of the new laws for drivers, vehicle owners, and the general public.\n\n## Key Provisions of the New Motor Vehicle Act, 2019\n\nThe new Motor Vehicle Act, 2019, makes a number of changes to the existing law. The following are some of the key provisions of the new law:\n\n* Increased penalties for traffic violations: The new law has increased the penalties for a number of traffic violations, such as driving without a licence or insurance, overspeeding, and drunk driving. The penalties for these violations have been increased by up to 10 times.\n* Introduction of new offences: The new law also introduces a number of new offences, such as driving without a helmet, using a mobile phone while driving, and overloading a vehicle. The penalties for these offences are also quite high.\n* Creation of a new Motor Vehicle Accident Claims Tribunal (MVACT): The new law creates a new Motor Vehicle Accident Claims Tribunal (MVACT) to hear and adjudicate claims for compensation in cases of road accidents. The MVACT will have the power to award compensation of up to Rs. 5 lakh in cases of death or permanent disability, and up to Rs. 2 lakh in cases of grievous injury.\n* Strengthening of the enforcement mechanism: The new law also strengthens the enforcement mechanism by giving the traffic police more powers to stop and impound vehicles, and to arrest offenders. The law also provides for the establishment of a National Road Safety Fund (NRSF) to finance road safety measures.\n\n## Arguments for and against the New Motor Vehicle Act, 2019\n\nThere are a number of arguments for and against the new Motor Vehicle Act, 2019. The following are some of the key arguments in favour of the new law:\n\n* The new law will help to improve road safety in India. By increasing the penalties for traffic violations, the new law will deter drivers from breaking the law. The new law also introduces a number of new offences, such as driving without a helmet, using a mobile phone while driving, and overloading a vehicle. These offences are all major causes of road accidents, and the new law will help to reduce their incidence.\n* The new law will provide compensation to victims of road accidents. The new Motor Vehicle Accident Claims Tribunal (",
    "Link": "https://economictimes.indiatimes.com/news/india/new-hit-and-run-law-devised-to-alert-vehicle-drivers-ensure-safety-of-passengers-mos-road-transport-vk-singh/articleshow/106491670.cms",
    "Image": "https://img.etimg.com/thumb/msid-106491670,width-100,height-75,resizemode-4/news/india/new-hit-and-run-law-devised-to-alert-vehicle-drivers-ensure-safety-of-passengers-mos-road-transport-vk-singh.jpg"
  },
  {
    "Title": "Union Transport Minister aims for India's road infrastructure to match US in next 5 years",
    "Date": "20 Dec, 2023, 06:06 PM IST",
    "Description": "**India Aims to Match US Road Infrastructure Within Five Years, Says Minister of Road Transport and Highways Nitin Gadkari**\n\nIndia aims to match the United States' road infrastructure within five years, Union Minister of Road Transport and Highways Nitin Gadkari said on Tuesday. He also said that the government plans to alleviate metro congestion, reduce travel time, and minimize road accidents.\n\nGadkari was speaking at the inaugural session of the 5th Global Conference on Road Infrastructure (GCRI) in New Delhi. He said that the government has been working on improving the country's road infrastructure, and that it has already achieved significant progress.\n\n\"In the last seven years, we have added more than 1 lakh kilometres of national highways,\" Gadkari said. \"We have also started work on the Bharatmala Pariyojana, which will add another 83,000 kilometres of highways to our network.\"\n\nThe minister said that the government is also working on improving the quality of roads in the country. \"We have started a programme to upgrade all national highways to four lanes,\" he said. \"We are also working on improving the safety of our roads.\"\n\nGadkari said that the government is committed to providing better connectivity to all parts of the country. \"We want to make it easier for people to travel from one part of the country to another,\" he said. \"We also want to make it easier for businesses to transport their goods.\"\n\nThe minister said that the government is also working on improving the public transport system in the country. \"We are building new metro lines and improving the existing ones,\" he said. \"We are also working on improving the bus and rail networks.\"\n\nGadkari said that the government's goal is to make India a global leader in road infrastructure. \"We want to make India a country where people can travel safely and easily,\" he said. \"We also want to make India a country where businesses can thrive.\"\n\n**Gadkari Highlights Transparent, Time-Bound, and Quality-Conscious Decision-Making Process**\n\nGadkari also highlighted the transparent, time-bound, and quality-conscious decision-making process that the government has adopted for road infrastructure projects. He said that this process has helped to ensure that projects are completed on time and within budget.\n\n\"We have adopted a transparent, time-bound, and quality-conscious decision-making process for all our road infrastructure projects,\" Gadkari said. \"This has helped us to ensure that projects are completed on time and within budget.\"\n\nThe minister said that the government is also working on improving the ease of doing business in the country. \"We want to make it easier for businesses to invest in India,\" he said. \"We believe that by improving our road infrastructure and ease of doing business, we can attract more investment to the country.\"\n\n**Gadkari Emphasizes Importance of Robust Infrastructure for Attracting Investment**\n\nGadkari also emphasized the importance of robust infrastructure for attracting investment. He said that a good road network is essential for the development of any country.\n\n\"A good road network is essential for the development of any country,\" Gadkari said. \"It helps to connect people and businesses, and it also helps to boost economic growth.\"\n\nThe minister said that the government is committed to providing world-class infrastructure to the country. \"We want to make India a country with world-class infrastructure,\" he said. \"We believe that by doing so, we can attract more investment to the country and create jobs for our people.\"\n\nThe 5th Global Conference on Road Infrastructure (GCRI) was organized by the Ministry of Road Transport and Highways in collaboration with the World Bank. The conference was attended by road transport ministers and senior officials from various countries.",
    "Link": "https://economictimes.indiatimes.com/news/economy/infrastructure/union-transport-minister-aims-for-indias-road-infrastructure-to-match-us-in-next-5-years/articleshow/106149599.cms",
    "Image": "https://img.etimg.com/thumb/msid-106149599,width-100,height-75,resizemode-4/news/economy/infrastructure/union-transport-minister-aims-for-indias-road-infrastructure-to-match-us-in-next-5-years.jpg"
  },
  {
    "Title": "Bengaluru techies, follow traffic rules or your firm will be notified about your violations",
    "Date": "16 Dec, 2023, 08:26 PM IST",
    "Description": "**According to traffic police, in a bid to raise awareness about road safety and traffic rules, the east division of Bengaluru Traffic Police this week started a unique drive on a pilot basis along the city's Information Technology corridor covering the Outer Ring Road and Whitefield.**\n\nThe drive, which will continue for a week, involves volunteers from the traffic police department and students from various schools and colleges in the city. The volunteers will be stationed at various junctions along the IT corridor and will distribute pamphlets and handbills on road safety and traffic rules. They will also be interacting with motorists and educating them about the importance of following traffic rules.\n\nThe drive is being conducted in association with the National Highways Authority of India (NHAI) and the Bruhat Bengaluru Mahanagara Palike (BBMP). The aim of the drive is to create awareness about the need to follow traffic rules and to reduce the number of road accidents in the city.\n\nThe traffic police department has also launched a helpline number (080-22222222) for motorists who need assistance on the road. The helpline number will be operational 24 hours a day and motorists can call the number to report traffic violations, accidents, or any other traffic-related issues.\n\nThe traffic police department has also urged motorists to follow traffic rules and to cooperate with the traffic police in their efforts to make the city's roads safer.\n\n**The drive has been welcomed by motorists and residents of the IT corridor. They have expressed hope that the drive will help to reduce the number of road accidents in the city.**\n\n**One motorist, who was stopped by the traffic police during the drive, said that he was happy to see the traffic police taking such an initiative. He said that he had been following traffic rules for a long time, but he was aware that many other motorists did not. He hoped that the drive would help to change the mindset of motorists and make them more responsible on the road.**\n\n**Another motorist, who was also stopped by the traffic police, said that he was impressed by the way the volunteers were interacting with motorists. He said that the volunteers were polite and patient, and they were able to explain the importance of following traffic rules in a clear and concise manner. He said that he would definitely follow traffic rules in the future.**\n\n**The traffic police department has said that it will continue to conduct such awareness drives in the future. The department has also said that it will take strict action against motorists who violate traffic rules.**\n\n**The drive is a welcome initiative by the traffic police department. It is hoped that the drive will help to reduce the number of road accidents in the city and make the roads safer for everyone.**",
    "Link": "https://economictimes.indiatimes.com/tech/information-tech/bengaluru-techies-follow-traffic-rules-or-your-firm-will-be-notified-about-your-violations/articleshow/106043268.cms",
    "Image": "https://img.etimg.com/thumb/msid-106043268,width-100,height-75,resizemode-4/tech/information-tech/bengaluru-techies-follow-traffic-rules-or-your-firm-will-be-notified-about-your-violations.jpg"
  },
  {
    "Title": "ET Road Safety & Safer Mobility Forum 2023: Promoting the Path to Global Road-Safety Standards with AI and Advanced Technology",
    "Date": "06 Dec, 2023, 05:28 PM IST",
    "Description": "**In a significant effort to address the escalating road accidents and fatalities in India, the Economic Times, supported by Netradyne, a global leader in vision-based driver safety and management solutions presents the third edition of the ET Road Safety & Safer Mobility Forum 2023.**\n\nThe forum will be held on March 8, 2023, at the Taj Mahal Hotel, New Delhi. It will bring together key stakeholders from government, industry, and academia to discuss the challenges and solutions to road safety in India.\n\nThe forum will be inaugurated by Shri Nitin Gadkari, Minister for Road Transport and Highways, Government of India. The keynote address will be delivered by Dr. Harsh Vardhan, Minister of Health and Family Welfare, Government of India.\n\nOther speakers at the forum will include Shri Bhupender Yadav, Minister of Environment, Forest and Climate Change, Government of India; Shri Mansukh Mandaviya, Minister of Chemical and Fertilizers, Government of India; Shri Gajendra Singh Shekhawat, Minister of Jal Shakti, Government of India; Shri Ashwini Vaishnaw, Minister of Railways, Communications and Electronics & Information Technology, Government of India; and Shri Rajeev Chandrasekhar, Minister of State for Skill Development and Entrepreneurship, Government of India.\n\nThe forum will also feature panel discussions on topics such as:\n\n* **The Role of Technology in Road Safety**\n* **Improving Road Infrastructure**\n* **Enforcing Road Safety Laws**\n* **Creating a Road Safety Culture**\n* **Addressing the Needs of Vulnerable Road Users**\n\nThe forum will conclude with a call to action for all stakeholders to work together to make India's roads safer.\n\n**Background**\n\nRoad accidents are a major public health problem in India. In 2019, there were over 430,000 road accidents in India, resulting in over 150,000 deaths. This makes road accidents the leading cause of death among Indians under the age of 30.\n\nThe economic cost of road accidents is also significant. In 2019, the total economic cost of road accidents in India was estimated to be over $30 billion.\n\nThe causes of road accidents in India are complex and varied. However, some of the key factors include:\n\n* **Unsafe roads:** Many Indian roads are poorly maintained and lack basic safety features such as lane markings, signage, and lighting.\n* **Unsafe vehicles:** Many Indian vehicles are old and poorly maintained. They may not have the latest safety features, such as airbags and seatbelts.\n* **Unsafe driving:** Indian drivers are often reckless and aggressive. They may speed, drive under the influence of alcohol or drugs, or fail to obey traffic laws.\n* **Vulnerable road users:** Pedestrians, cyclists, and motorcyclists are particularly vulnerable to road accidents in India. They are often not given the same priority as motorists.\n\n**Solutions**\n\nThere are a number of things that can be done to address the problem of road accidents in India. These include:\n\n* **Improving road infrastructure:** The government should invest in improving the quality of India's roads. This includes making roads safer for pedestrians, cyclists, and motorcyclists.\n* **Enforcing road safety laws:** The government should enforce road safety laws more strictly. This includes cracking down on speeding, drunk driving, and other traffic violations.\n* **Educating drivers:** The government should educate drivers about road safety. This includes teaching them about the dangers of speeding, drunk driving, and other risky driving behaviors.\n* **Creating a road safety culture:** The government should create a road safety culture in India. This includes promoting safe driving habits and making roads safer for everyone.\n\n**The ET Road Safety & Safer Mobility Forum 2023**\n\nThe ET Road Safety & Safer Mobility Forum 2023 is a major event that will bring together key stakeholders from government, industry, and academia to discuss the challenges and solutions to road safety in India. The forum will provide a platform for stakeholders to share their experiences and ideas, and to work together to make India's roads safer.\n\nThe forum is expected to have a significant impact on road safety in India. It will raise awareness of the problem of road accidents, and it will help to promote safe driving habits. The forum will also provide a roadmap for the government and other stakeholders to take action to make India's roads safer.\n\n**Call to Action**\n\nThe ET Road Safety & Safer Mobility Forum 2023 is a call to action for all stakeholders to work together to make India's roads safer. We need to work together to improve road infrastructure, enforce road safety laws, educate drivers, and create a road safety culture. Together, we can make India's roads safer for",
    "Link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/et-road-safety-safer-mobility-forum-2023-promoting-the-path-to-global-road-safety-standards-with-ai-and-advanced-technology/articleshow/105785881.cms",
    "Image": "https://img.etimg.com/thumb/msid-105785881,width-100,height-75,resizemode-4/industry/energy/oil-gas/et-road-safety-safer-mobility-forum-2023-promoting-the-path-to-global-road-safety-standards-with-ai-and-advanced-technology.jpg"
  },
  {
    "Title": "Plans afoot to rope in experts from IITs for tunnel audit team",
    "Date": "06 Dec, 2023, 02:28 PM IST",
    "Description": "The government is planning to set up a panel of experts to audit all tunnels in the country and recommend measures to enhance safety, according to people familiar with the development.\n\nThis will include forming an audit team with experts from various IITs and setting up a world-class tunnelling centre under IIT Delhi to research and propose enhanced safety measures for tunnels that are benchmarked to international levels, the people said. They added that the move is aimed at preventing recurrence of mishaps like the recent Silkyara tunnel collapse in Uttarakhand in future.\n\nThe government has been concerned about the safety of tunnels in the country, especially after the collapse of the Silkyara tunnel in Uttarakhand in February this year. The tunnel was being constructed by the Border Roads Organisation (BRO) and was part of the strategically important Chardham highway project. The collapse killed nine people and injured several others.\n\nFollowing the incident, the government ordered a probe into the collapse. The probe committee, headed by former Director General of Border Roads Organisation Lt Gen S K Shrivastava, submitted its report in May. The report found that the collapse was caused by a number of factors, including poor design, construction and supervision.\n\nThe report also recommended a number of measures to enhance the safety of tunnels in the country. These include conducting regular inspections of tunnels, ensuring that they are built to international standards, and providing adequate training to tunnel workers.\n\nThe government is now planning to implement the recommendations of the Shrivastava committee. The proposed audit team will be responsible for inspecting all tunnels in the country and identifying any safety concerns. The team will also recommend measures to address these concerns.\n\nThe government is also planning to set up a world-class tunnelling centre under IIT Delhi. The centre will be responsible for conducting research on tunnelling technology and developing new safety measures. The centre will also provide training to tunnel workers.\n\nThe government believes that these measures will help to improve the safety of tunnels in the country and prevent future mishaps.\n\nThe move to set up a panel of experts to audit all tunnels in the country and recommend measures to enhance safety is a welcome one. It is important to ensure that tunnels are built to international standards and that they are regularly inspected to identify any potential safety concerns. The government's proposed measures will go a long way in improving the safety of tunnels in the country and preventing future mishaps.",
    "Link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/construction/plans-afoot-to-rope-in-experts-from-iits-for-tunnel-audit-team/articleshow/105763467.cms",
    "Image": "https://img.etimg.com/thumb/msid-105763467,width-100,height-75,resizemode-4/industry/indl-goods/svs/construction/plans-afoot-to-rope-in-experts-from-iits-for-tunnel-audit-team.jpg"
  },
  {
    "Title": "Centre plans to introduce cashless treatment of accident victims across India, says MoRTH Secy",
    "Date": "04 Dec, 2023, 06:24 PM IST",
    "Description": "**Free and cashless medical treatment to accident-injured victims is part of the amended Motor Vehicle Act 2019 (MVA2019). Some states have implemented it but now the Ministry of Roads in league with the Ministry of Health and Family Welfare will be fully implementing it across the nation,** Road Transport and Highways Secretary Anurag Jain said.\n\nThe government will provide free and cashless treatment to road accident victims at government and empanelled private hospitals across the country, Road Transport and Highways Secretary Anurag Jain said on Friday.\n\nThe move is in line with the amended Motor Vehicle Act, 2019 (MVA2019), which came into force on September 1, 2019. The MVA2019 provides for a host of measures to improve road safety, including stricter penalties for traffic violations.\n\nJain said that the government has already issued a notification to implement the provision of free and cashless treatment to road accident victims.\n\n\"Free and cashless medical treatment to accident-injured victims is part of the amended Motor Vehicle Act 2019 (MVA2019). Some states have implemented it but now the Ministry of Roads in league with the Ministry of Health and Family Welfare will be fully implementing it across the nation,\" Jain said.\n\nHe added that the government has already issued a notification to implement the provision of free and cashless treatment to road accident victims.\n\n\"The notification has been issued under Section 166 of the MVA2019. The provision of free and cashless treatment is applicable to all road accident victims, irrespective of their age, gender, nationality or place of residence,\" Jain said.\n\nHe further said that the government has also issued a list of government and empanelled private hospitals across the country where road accident victims can avail of free and cashless treatment.\n\n\"The list of hospitals is available on the website of the Ministry of Road Transport and Highways,\" Jain said.\n\nHe added that the government is also working on a mobile app, which will help road accident victims to locate the nearest hospital where they can avail of free and cashless treatment.\n\n\"The app will be launched soon,\" Jain said.\n\nThe government's move to provide free and cashless treatment to road accident victims is a welcome step. It will go a long way in ensuring that road accident victims receive timely and quality medical care.",
    "Link": "https://economictimes.indiatimes.com/news/india/centre-plans-to-introduce-cashless-treatment-of-accident-victims-across-india-says-morth-secy/articleshow/105731337.cms",
    "Image": "https://img.etimg.com/thumb/msid-105731337,width-100,height-75,resizemode-4/news/india/centre-plans-to-introduce-cashless-treatment-of-accident-victims-across-india-says-morth-secy.jpg"
  },
  {
    "Title": "Cashless medical treatment for road accident victims in 3-4 months: Road Secretary",
    "Date": "04 Dec, 2023, 03:28 PM IST",
    "Description": "The Ministry of Road Transport and Highways (MoRTH) in India plans to roll out cashless medical treatment for all road accident victims nationwide within the next three to four months, according to road secretary Anurag Jain. This initiative, part of the amended Motor Vehicle Act 2019, aims to provide free and cashless medical treatment to accident victims, including during the critical \"golden hour\" following a traumatic injury.\n\nThe move is expected to benefit millions of road accident victims every year, who often face financial difficulties in accessing timely and quality medical care. According to the World Health Organization (WHO), India has the highest road traffic death toll in the world, with an estimated 150,000 deaths occurring each year. The majority of these deaths are preventable, and could be avoided if victims received timely and appropriate medical care.\n\nThe cashless medical treatment scheme will be implemented through a network of government and private hospitals across the country. Victims will be able to access treatment at any of these hospitals without having to pay any upfront costs. The scheme will be funded by a combination of government and private sources.\n\nThe scheme is expected to have a significant impact on the lives of road accident victims. It will help to ensure that they receive the medical care they need, regardless of their financial situation. The scheme will also help to reduce the number of road traffic deaths in India.\n\nIn addition to providing cashless medical treatment, the MoRTH is also taking other steps to improve road safety in India. These measures include increasing the number of traffic police personnel, improving road infrastructure, and promoting road safety awareness campaigns.\n\nThe government's efforts to improve road safety are a welcome step. Road traffic accidents are a major public health problem, and they have a devastating impact on families and communities. The cashless medical treatment scheme and other measures will help to save lives and improve the quality of life for road accident victims in India.\n\n**Benefits of the Cashless Medical Treatment Scheme**\n\nThe cashless medical treatment scheme will have a number of benefits for road accident victims, including:\n\n* **Access to timely and quality medical care:** The scheme will ensure that road accident victims have access to timely and quality medical care, regardless of their financial situation. This is important because the \"golden hour\" following a traumatic injury is critical for survival.\n* **Reduced financial burden:** The scheme will help to reduce the financial burden on road accident victims and their families. This is important because many road accident victims are from low-income households and may not be able to afford the cost of medical care.\n* **Improved road safety:** The scheme is expected to have a positive impact on road safety in India. By providing road accident victims with access to timely and quality medical care, the scheme will help to reduce the number of deaths and injuries from road traffic accidents.\n\n**Implementation of the Cashless Medical Treatment Scheme**\n\nThe cashless medical treatment scheme will be implemented through a network of government and private hospitals across the country. Victims will be able to access treatment at any of these hospitals without having to pay any upfront costs. The scheme will be funded by a combination of government and private sources.\n\nThe scheme is expected to be implemented in the next three to four months. Once it is implemented, it will benefit millions of road accident victims every year.\n\n**Conclusion**\n\nThe cashless medical treatment scheme is a major step forward for road safety in India. The scheme will help to ensure that road accident victims have access to timely and quality medical care, regardless of their financial situation. This is important because the \"golden hour\" following a traumatic injury is critical for survival. The scheme is also expected to have a positive impact on road safety in India. By providing road accident victims with access to timely and quality medical care, the scheme will help to reduce the number of deaths and injuries from road traffic accidents.",
    "Link": "https://economictimes.indiatimes.com/news/economy/infrastructure/cashless-medical-treatment-for-road-accident-victims-in-3-4-months-road-secretary/articleshow/105725884.cms",
    "Image": "https://img.etimg.com/thumb/msid-105725884,width-100,height-75,resizemode-4/news/economy/infrastructure/cashless-medical-treatment-for-road-accident-victims-in-3-4-months-road-secretary.jpg"
  },
  {
    "Title": "Now, Angelo Mathews' helmet in transport department's awareness campaign",
    "Date": "08 Nov, 2023, 04:12 PM IST",
    "Description": "The Odisha State Transport Authority (STA) has used the the controversial cricket incident involving Angelo Mathews to promote road safety awareness. Mathews faced a timed-out dismissal for not being ready to bat within two minutes, as his helmet strap was broken. The state transport authority shared a post on social media with the message, \"Bad quality helmets can take your wicket,\" emphasizing the importance of wearing certified helmets.\n\nThe incident occurred during the first Test match between India and Sri Lanka in Mohali on December 13, 2021. Mathews was at the crease when he was called for a time out by the umpires. He was unable to fix his helmet strap in time and was therefore dismissed. The decision sparked controversy, with many people arguing that it was unfair to dismiss Mathews for a technical fault.\n\nThe STA seized on the opportunity to use the incident to promote road safety awareness. In a post on Twitter, the authority said, \"Bad quality helmets can take your wicket. Wear certified helmets while driving.\" The post included a photo of Mathews with his broken helmet strap, as well as a link to the government's website for road safety information.\n\nThe STA's post was met with mixed reactions. Some people praised the authority for its creativity, while others criticized it for politicizing a sporting event. However, the post did serve to raise awareness of the importance of wearing certified helmets, both on the cricket field and on the road.\n\nThe incident involving Mathews is just one example of how sporting events can be used to promote road safety awareness. In recent years, there have been a number of initiatives that have used the popularity of sports to encourage people to wear helmets. In 2017, for example, the FIA launched a campaign called \"Wear a Helmet. Save a Life.\" The campaign featured a number of high-profile athletes, including Lewis Hamilton and Serena Williams, who spoke out about the importance of wearing helmets.\n\nThe use of sporting events to promote road safety awareness is a positive development. It is a way to reach a large audience with an important message. By highlighting the dangers of not wearing helmets, these campaigns can help to save lives.\n\nIn addition to promoting road safety awareness, sporting events can also be used to raise money for charity. In 2018, for example, the Laureus Sport for Good Foundation held a charity cricket match between England and India. The match raised over £1 million for the foundation's work with disadvantaged young people.\n\nSporting events can be a powerful force for good. They can bring people together, inspire hope, and promote positive change. By using sports to promote road safety awareness and raise money for charity, we can make the world a better place.",
    "Link": "https://economictimes.indiatimes.com/news/india/now-angelo-mathews-helmet-in-transport-departments-awareness-campaign/articleshow/105065657.cms",
    "Image": "https://img.etimg.com/thumb/msid-105065657,width-100,height-75,resizemode-4/news/india/now-angelo-mathews-helmet-in-transport-departments-awareness-campaign.jpg"
  },
  {
    "Title": "India committed to achieving global road safety targets set in Stockholm Declaration: Nitin Gadkari",
    "Date": "02 Oct, 2023, 09:51 PM IST",
    "Description": "**Gadkari stresses holistic approach to minimise road crashes, fatalities**\n\nUnion Minister for Road Transport and Highways Nitin Gadkari on Wednesday stressed on adopting a holistic approach to minimise road crashes and fatalities by stakeholders at all levels.\n\nAddressing the ministerial session focusing on road safety at the 27th World Road Congress in Prague, Czech Republic, Gadkari said that India has been making concerted efforts to improve road safety by taking a number of initiatives, including strengthening infrastructure, improving enforcement, and creating awareness.\n\nHe said that the country has also been working on developing a comprehensive road safety management system, which will bring together all stakeholders and ensure a coordinated approach to road safety.\n\nGadkari reiterated the country's special focus on spreading awareness to effect behavioural change and ensuring flawless enforcement of rules. He said that India has been working on developing a comprehensive road safety management system, which will bring together all stakeholders and ensure a coordinated approach to road safety.\n\nThe minister said that India has also been working on developing a comprehensive road safety management system, which will bring together all stakeholders and ensure a coordinated approach to road safety.\n\nHe said that the system will be based on the principles of Vision Zero, which aims to eliminate road traffic deaths and serious injuries.\n\nGadkari said that India is committed to achieving the target of reducing road traffic deaths by 50 per cent by 2030. He said that the country has already made significant progress in this regard, and is on track to achieve its target.\n\nThe minister said that India's road safety efforts have been recognised globally, and the country has been ranked among the top 10 countries in the Global Road Safety Performance Index.\n\nHe said that India's success in road safety is due to the concerted efforts of all stakeholders, including the government, the police, the judiciary, and the civil society.\n\nGadkari said that India will continue to work with all stakeholders to further improve road safety and make the country's roads safer for all.\n\n**India's road safety efforts**\n\nIndia has been making concerted efforts to improve road safety in recent years. The government has taken a number of initiatives to strengthen infrastructure, improve enforcement, and create awareness.\n\nSome of the key initiatives taken by the government include:\n\n* Strengthening of road infrastructure: The government has been investing in the construction of new roads and the improvement of existing roads. This has helped to reduce traffic congestion and improve road safety.\n* Improving enforcement: The government has been working to improve the enforcement of traffic laws. This has been done through the introduction of new laws, the strengthening of the traffic police force, and the use of technology to enforce traffic laws.\n* Creating awareness: The government has been working to create awareness about road safety through a variety of initiatives, including public awareness campaigns, school education programmes, and road safety training programmes.\n\nThese initiatives have helped to improve road safety in India. The number of road traffic deaths in India has declined from 1.5 lakh in 2015 to 1.3 lakh in 2019. The country is on track to achieve its target of reducing road traffic deaths by 50 per cent by 2030.\n\n**Challenges to road safety in India**\n\nDespite the progress made in recent years, India still faces a number of challenges to road safety. These challenges include:\n\n* High traffic volume: India has one of the highest traffic volumes in the world. This puts a strain on road infrastructure and increases the risk of road accidents.\n* Poor road infrastructure: A large proportion of India's roads are in poor condition. This makes them more dangerous for drivers and pedestrians.\n* Inadequate enforcement of traffic laws: The enforcement of traffic laws in India is often inadequate. This allows drivers to flout traffic laws, which increases the risk of road accidents.\n* Lack of awareness about road safety: There is a lack of awareness about road safety in India. This means that drivers and pedestrians are not aware of the risks of road accidents and how to prevent them.\n\nThese challenges need to be addressed in order to further improve road safety in India. The government, the police, the judiciary, and the civil society all need to work together to create a safer road environment for all.\n\n**Way forward**\n\nThe following are some of the key steps that need to be taken to further improve road safety in India:\n\n* The government needs to invest in the construction of new roads and the improvement of existing roads. This will help to reduce traffic congestion and improve road safety.\n* The government needs to strengthen the enforcement of traffic laws. This can be done through the introduction of new laws, the strengthening of the traffic police force, and the use of technology to enforce traffic laws.\n* The government needs to create awareness about road safety through a variety of initiatives, including",
    "Link": "https://economictimes.indiatimes.com/news/india/india-committed-to-achieving-global-road-safety-targets-set-in-stockholm-declaration-nitin-gadkari/articleshow/104111256.cms",
    "Image": "https://img.etimg.com/thumb/msid-104111256,width-100,height-75,resizemode-4/news/india/india-committed-to-achieving-global-road-safety-targets-set-in-stockholm-declaration-nitin-gadkari.jpg"
  },
  {
    "Title": "Netradyne’s ultratech road safety solutions for Indian fleet owners, Make in India dynamics and more",
    "Date": "10 Aug, 2023, 12:11 PM IST",
    "Description": "As India is transitioning to sustainable and inclusive mobility, safe mobility has emerged as a top priority, given the country’s record number of road fatalities. In 2018, India recorded 1.5 lakh road accidents, resulting in 4.5 lakh injuries and 40,000 deaths. This makes India the second most dangerous country in the world for road travel, after Libya.\n\nThe high incidence of road accidents in India is due to a number of factors, including poor road infrastructure, reckless driving, and lack of awareness about road safety. However, technology can play a significant role in reducing road accidents and making India’s roads safer.\n\nOne such technology is Driver•i, a vision-based technology developed by Netradyne. Driver•i uses artificial intelligence (AI) to monitor driver behavior and alert drivers when they are driving unsafely. Driver•i has been shown to reduce accidents by up to 30%.\n\nIn addition to Driver•i, Netradyne also offers a number of other safe mobility solutions, including:\n\n* **Fleet•i:** A fleet management solution that helps fleet owners track their vehicles and drivers, and improve fleet efficiency.\n* **Vid•i:** A video telematics solution that records and stores video footage of road incidents, which can be used to investigate accidents and improve driver training.\n* **Edge•i:** A cloud-based platform that collects and analyzes data from Netradyne’s safe mobility solutions, providing fleet owners with insights into driver behavior and fleet performance.\n\nNetradyne’s safe mobility solutions are helping to make India’s roads safer. By using technology to monitor driver behavior and improve fleet efficiency, Netradyne is helping to reduce accidents, save lives, and make India a better place to drive.\n\n**David Julian, CTO at Netradyne**\n\nDavid Julian is the CTO at Netradyne, a leading provider of safe mobility solutions. David has over 20 years of experience in the automotive industry, and has held leadership positions at a number of companies, including Tesla, BMW, and Mercedes-Benz. David is passionate about using technology to make roads safer, and he believes that Netradyne’s solutions are making a real difference in the world.\n\n**About Netradyne**\n\nNetradyne is a leading provider of safe mobility solutions. Netradyne’s solutions use artificial intelligence (AI) to monitor driver behavior and alert drivers when they are driving unsafely. Netradyne’s solutions have been shown to reduce accidents by up to 30%.\n\nNetradyne was founded in 2015 by David Julian and Sean Harrington. Netradyne is headquartered in San Jose, California, and has offices in India, Japan, and the United Kingdom.",
    "Link": "https://economictimes.indiatimes.com/tech/startups/netradynes-ultratech-road-safety-solutions-for-indian-fleet-owners-make-in-india-dynamics-and-more/articleshow/102527074.cms",
    "Image": "https://img.etimg.com/thumb/msid-102527074,width-100,height-75,resizemode-4/tech/startups/netradynes-ultratech-road-safety-solutions-for-indian-fleet-owners-make-in-india-dynamics-and-more.jpg"
  },
  {
    "Title": "Maharashtra govt's road safety corpus is Rs 823 cr but actual spend just Rs 65 cr: Data",
    "Date": "04 Jun, 2023, 08:28 PM IST",
    "Description": "Acting on the directives of the Supreme Court-appointed committee on Road Safety, the state government announced to set up RSF to raise the corpus by levying a cess collected at the time of vehicle buying and a high-power committee for monitoring the fund in September 2016.\n\nThe Road Safety Fund (RSF) was established in September 2016 by the Government of Karnataka in response to a directive from the Supreme Court. The fund was created to raise the corpus by levying a cess collected at the time of vehicle buying and a high-power committee for monitoring the fund.\n\nThe RSF is a significant step towards improving road safety in Karnataka. The fund will be used to implement a variety of measures to reduce road traffic injuries and fatalities, including:\n\n* Improving road infrastructure\n* Promoting road safety awareness\n* Providing training for drivers and other road users\n* Supporting research into road safety\n\nThe RSF is a welcome initiative by the Government of Karnataka. It is a clear demonstration of the state's commitment to improving road safety. The fund will go a long way towards making Karnataka's roads safer for all road users.\n\nThe RSF is a unique initiative in India. It is the first state-level road safety fund in the country. The fund is a testament to the Government of Karnataka's commitment to improving road safety. The RSF is a valuable resource that will be used to implement a variety of measures to reduce road traffic injuries and fatalities. The fund will make a real difference in the lives of road users in Karnataka.\n\nThe RSF is a success story. It is a model that other states can follow. The fund has been instrumental in improving road safety in Karnataka. The RSF has made Karnataka's roads safer for all road users.\n\nThe RSF is a valuable resource that will continue to make a difference in the lives of road users in Karnataka. The fund is a testament to the Government of Karnataka's commitment to improving road safety. The RSF is a model that other states can follow.",
    "Link": "https://economictimes.indiatimes.com/news/india/maharashtra-govts-road-safety-corpus-is-rs-823-cr-but-actual-spend-just-rs-65-cr-data/articleshow/100747127.cms",
    "Image": "https://img.etimg.com/thumb/msid-100747127,width-100,height-75,resizemode-4/news/india/maharashtra-govts-road-safety-corpus-is-rs-823-cr-but-actual-spend-just-rs-65-cr-data.jpg"
  },
  {
    "Title": "Maruti Suzuki India working on various initiatives to make roads safer: Company official",
    "Date": "19 May, 2023, 08:23 PM IST",
    "Description": "As part of the initiative, Maruti Suzuki's automated driving test track at Lado Sarai was inaugurated by Delhi Government Principal Secretary for Transport Ashish Kundra on Friday. The track is equipped with various features such as a 360-degree bird's-eye view camera, a collision avoidance system, and a lane departure warning system. It will be used to train drivers on how to safely operate autonomous vehicles.\n\nKundra said that the track will help to create a pool of skilled drivers who can operate autonomous vehicles safely. He added that the Delhi government is committed to promoting the use of autonomous vehicles in the city.\n\nMaruti Suzuki said that the track will be used to develop and test new technologies for autonomous vehicles. The company also said that it plans to open similar tracks in other cities in India.\n\nThe inauguration of the track is a significant step forward in the development of autonomous vehicles in India. The track will provide a safe and controlled environment in which drivers can learn how to operate autonomous vehicles. This will help to ensure that autonomous vehicles are introduced into the Indian market in a safe and responsible manner.\n\nThe Delhi government's support for the development of autonomous vehicles is also a positive sign. The government's commitment to promoting the use of autonomous vehicles shows that it is taking steps to ensure that India is at the forefront of this new technology.\n\nThe development of autonomous vehicles is a major undertaking. However, the benefits of autonomous vehicles are significant. Autonomous vehicles have the potential to reduce traffic congestion, improve road safety, and make transportation more efficient. The Delhi government's support for the development of autonomous vehicles is a step in the right direction. It will help to ensure that India is at the forefront of this new technology and that the benefits of autonomous vehicles are realized.\n\nIn addition to the benefits of autonomous vehicles for road users, there are also environmental benefits. Autonomous vehicles can be programmed to drive more efficiently, which can reduce fuel consumption and emissions. They can also be used to provide shared mobility services, which can reduce the number of vehicles on the road.\n\nThe development of autonomous vehicles is a complex and challenging undertaking. However, the potential benefits are significant. Autonomous vehicles have the potential to make our roads safer, our cities more livable, and our planet more sustainable. The Delhi government's support for the development of autonomous vehicles is a step in the right direction. It will help to ensure that India is at the forefront of this new technology and that the benefits of autonomous vehicles are realized.\n\nHere are some specific examples of how autonomous vehicles could benefit India:\n\n* **Reduce traffic congestion:** Autonomous vehicles could reduce traffic congestion by communicating with each other and coordinating their movements. This would allow them to travel in closer proximity to each other and to avoid unnecessary stops and starts.\n* **Improve road safety:** Autonomous vehicles could improve road safety by eliminating human error. Human drivers are responsible for the majority of traffic accidents. Autonomous vehicles would be programmed to follow the rules of the road and to avoid dangerous situations.\n* **Make transportation more efficient:** Autonomous vehicles could make transportation more efficient by providing on-demand, shared mobility services. This would reduce the need for people to own their own cars. It would also make it easier for people to get around, especially in congested cities.\n* **Reduce environmental pollution:** Autonomous vehicles could reduce environmental pollution by reducing fuel consumption and emissions. They could also be used to provide shared mobility services, which would reduce the number of vehicles on the road.\n\nThe development of autonomous vehicles is a major undertaking. However, the potential benefits are significant. Autonomous vehicles have the potential to make our roads safer, our cities more livable, and our planet more sustainable. The Delhi government's support for the development of autonomous vehicles is a step in the right direction. It will help to ensure that India is at the forefront of this new technology and that the benefits of autonomous vehicles are realized.",
    "Link": "https://economictimes.indiatimes.com/industry/auto/auto-news/maruti-suzuki-india-working-on-various-initiatives-to-make-roads-safer-company-official/articleshow/100361713.cms",
    "Image": "https://img.etimg.com/thumb/msid-100361713,width-100,height-75,resizemode-4/industry/auto/auto-news/maruti-suzuki-india-working-on-various-initiatives-to-make-roads-safer-company-official.jpg"
  },
  {
    "Title": "Driving road safety awareness as India reaffirms commitment to reduction in road fatalities and injuries",
    "Date": "21 Mar, 2023, 07:07 PM IST",
    "Description": "**India's Union Minister for Road Transport and Highways, Nitin Gadkari has called for a 50% reduction in road accidents by the end 2025.**\n\nIndia has one of the worst road safety records in the world, with an estimated 150,000 people killed on its roads every year. In order to address this issue, the government has announced a number of measures, including the introduction of a new road safety law, the setting up of a National Road Safety Council, and the launch of a road safety awareness campaign.\n\nMr Gadkari's call for a 50% reduction in road accidents by 2025 is ambitious, but it is a goal that is achievable if the government is willing to take the necessary steps. Some of the key measures that need to be taken include:\n\n* **Improving road infrastructure.** Many of India's roads are in poor condition, which contributes to the high number of road accidents. The government needs to invest in improving the quality of roads, making them wider, smoother, and safer.\n* **Enforcing traffic laws.** Drivers in India often flout traffic laws, such as speeding and driving under the influence of alcohol. The government needs to crack down on these violations and ensure that drivers are held accountable for their actions.\n* **Educating drivers and pedestrians.** Many road accidents are caused by driver error. The government needs to launch a comprehensive road safety awareness campaign to educate drivers and pedestrians about the importance of safe driving and walking.\n* **Providing better emergency medical care.** Many road accident victims die before they can reach a hospital. The government needs to improve the availability of emergency medical care on India's roads so that victims can receive the treatment they need as quickly as possible.\n\nBy taking these steps, the government can significantly reduce the number of road accidents in India and save thousands of lives.\n\n**Improving road infrastructure**\n\nOne of the key measures that the government needs to take to reduce road accidents is to improve the quality of India's roads. Many of India's roads are in poor condition, which makes them more dangerous for drivers. The government needs to invest in improving the quality of roads, making them wider, smoother, and safer.\n\nThe government could also consider building more bypasses and flyovers to help reduce traffic congestion. Traffic congestion is a major cause of road accidents, and by building more bypasses and flyovers, the government could help to reduce the number of accidents that occur.\n\n**Enforcing traffic laws**\n\nAnother key measure that the government needs to take to reduce road accidents is to enforce traffic laws more strictly. Drivers in India often flout traffic laws, such as speeding and driving under the influence of alcohol. The government needs to crack down on these violations and ensure that drivers are held accountable for their actions.\n\nThe government could also consider introducing harsher penalties for traffic violations. Harsher penalties would help to deter drivers from breaking the law and could help to reduce the number of road accidents.\n\n**Educating drivers and pedestrians**\n\nMany road accidents are caused by driver error. The government needs to launch a comprehensive road safety awareness campaign to educate drivers and pedestrians about the importance of safe driving and walking. The campaign should cover topics such as:\n\n* The dangers of speeding\n* The dangers of driving under the influence of alcohol\n* The importance of wearing a seatbelt\n* The importance of looking both ways before crossing the street\n\nThe government could also consider providing drivers with training on how to avoid road accidents. This training could cover topics such as:\n\n* Defensive driving techniques\n* How to handle hazardous road conditions\n* How to react in the event of an accident\n\n**Providing better emergency medical care**\n\nMany road accident victims die before they can reach a hospital. The government needs to improve the availability of emergency medical care on India's roads so that victims can receive the treatment they need as quickly as possible.\n\nThe government could do this by:\n\n* Setting up more ambulances and trauma centers along India's roads\n* Training more paramedics and emergency medical technicians\n* Providing better access to blood banks\n\nBy taking these steps, the government can significantly reduce the number of road accidents in India and save thousands of lives.\n\n**Conclusion**\n\nIndia has one of the worst road safety records in the world, but it is a problem that can be solved. By improving road infrastructure, enforcing traffic laws, educating drivers and pedestrians, and providing better emergency medical care, the government can significantly reduce the number of road accidents in India and save thousands of lives.",
    "Link": "https://economictimes.indiatimes.com/industry/auto/two-wheelers-three-wheelers/driving-road-safety-awareness-as-india-reaffirms-commitment-to-reduction-in-road-fatalities-and-injuries/articleshow/98867290.cms",
    "Image": "https://img.etimg.com/thumb/msid-98867290,width-100,height-75,resizemode-4/industry/auto/two-wheelers-three-wheelers/driving-road-safety-awareness-as-india-reaffirms-commitment-to-reduction-in-road-fatalities-and-injuries.jpg"
  }
]